# TagText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementTag..::..TagText Property
SpatialElementTag Class See Also
---
The text displayed by the tag.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public string TagText { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TagText As String
	Get
```

Visual C++
---
```text
public:
property String^ TagText {
	String^ get ();
}
```

# Remarks
If there are several strings included in the tag, the strings will be returned concatenated.
# See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace